/**
 * task1_main 
 * 1) Реальизуйте класс "Product" содержащий данный о товаре и
 *    класс VendingMachine содержащий в себе методы:
 *      initProducts(List<Product>) - сохраняющий в себе список исходных продуктов
 *      getProduct(String name) - который возвращает товар по его названию
 * 2) Реализуйте конструкторы, get/set методы, постройте логику VendingMachine на основе
 * кода сделанного в Пункте 1.
 * 3) Сделайте класс Product фбстрактным, создайте несколько наследников (например: БутылкаВоды),
 * сделайте интерфейсом VendingMachine и реализуйте класс какого-то одного типа VendingMachine
 * (пример: ПродающийБутылкиВодыАвтомат). 
 */
public class task1_main {
    public static void main(String[] args) {
    
        
    }
    
}